const experList = [
  {
    headerList: ['杭州博彦信息技术有限公司', '2018.7 - 至今', 'Web前端开发工程师'],
    workList: [
      '与UI设计、产品、后台开发人员保持良好沟通，以能够快速理解各方需求，评估开发时间，及时完成开发工作；',
      '根据业务诉求，选择合适的前端技术和设计模式；',
      '封装组件和方法；',
      '与产品、UI和后端做良好的沟通，保证产品的质量和开发进度；',
      '协助产品和测试人员对提出的BUG进行快速的定位和修复；',
      '页面优化，模块化组件化开发；'
    ]
  },
  {
    headerList: ['浙江群立时代科技有限公司', '2018.2 - 2018.6', 'Web前端开发工程师'],
    workList: [
      '依据业务需求完成高质量的跨终端Web的前端开发和维护；',
      '根据测试人员提出的问题，快速修复项目中的BUG；',
      '及时反馈交互视觉不合理的地方；',
      '封装组件和方法；',
      '负责页面前端性能优化，保证用户页面打开速度和操作体验；'
    ]
  }
]

const proList = [
  {
   proName: 'CRM客户关系管理系统',
   desc: 'PC端React项目，旨在提升销售在销售过程中线上化效率及产能。',
   list: [
     '需求时间评估，与团队做好沟通，把握进度；',
     '参与设计项目数据方案，动态渲染前端组件；',
     '独立开发公共通用的React组件；',
     '基于项目设计方式，开发一套可以使独立组件自由通信的方法；',
     '对接阿里通信，实现浏览器拨打电话；',
     '项目优化，减少不必要的渲染，减少请求次数；',
     '前端埋点监控；'
   ],
   res: 'CRM新系统上线获得一片好评，相对于老系统来说，无论是样式排版还是反应速度都有了质的飞跃，极大的提升了销售效率。'
  },
  {
    proName: 'work1688商家工作台',
    desc: '1688商家工作台部分模块（大促活动指挥部、实商头衔、经营攻略设置镇店之宝、数据看板、诚信通引导、最低价查询···）。',
    list: [
      '严格遵循开发规范；',
      '开发独立可配置表格、弹窗组件；',
      '抽象公共函数、组件',
      'codeReview及时发现代码中的不合理；'
    ],
    res: '日均活跃商家数30万，大促活动指挥部日均访客uv5w+，实商头衔上线首日行动率超过50%，最低价查询上线后求助量同比9月大促下降47%。'
  },
  {
    proName: '诚信通官网',
    desc: '改版诚信通官网。',
    list: [
      '及时与UI以及产品沟通；',
      '代码填坑，部分数据获取设置兜底；',
      '独立开发公共通用的React组件；',
      '将易改动的部分，设计成产品运营可配置；'
    ],
    res: '改版后，日均自助订购转化率13%左右，得到总数据40%左右的增长。'
  },
  {
    proName: 'HOPESHOW红袖',
    desc: '微信小程序项目，专门为红袖企业定制，是一个电商类小程序。',
    list: [
      '规范设计，确保上线代码不超过2M；',
      '定位代码问题或微信小程序功能问题并反馈；',
      '响应式布局；',
      '抽象公共函数、组件；'
    ]
  },
  {
    proName: 'HOPESHOW红袖 营销助手',
    desc: 'vue开发的app，为HOPESHOW红袖营销平台移动版，统计各种指标数据。',
    list: [
      'vue全家桶；',
      '响应式布局，兼容各个手机端；',
      '抽象公共函数、组件；',
      '熟练使用第三方图表库；'
    ]
  }
]

export { experList, proList };