const experList = [
  {
    headerList: ['杭州博彦信息技术有限公司', '2018.7 - 至今', 'Web前端开发工程师'],
    workList: [
      '与UI设计、产品、后台开发人员保持良好沟通，以能够快速理解各方需求，评估开发时间，及时完成开发工作；',
      '根据业务诉求，选择合适的前端技术和设计模式；',
      '封装组件和方法；',
      '与产品、UI和后端做良好的沟通，保证产品的质量和开发进度；',
      '协助产品和测试人员对提出的BUG进行快速的定位和修复；',
      '页面优化，模块化组件化开发；'
    ]
  },
  {
    headerList: ['浙江群立时代科技有限公司', '2018.2 - 2018.6', 'Web前端开发工程师'],
    workList: [
      '依据业务需求完成高质量的跨终端Web的前端开发和维护；',
      '根据测试人员提出的问题，快速修复项目中的BUG；',
      '及时反馈交互视觉不合理的地方；',
      '封装组件和方法；',
      '负责页面前端性能优化，保证用户页面打开速度和操作体验；'
    ]
  }
]

export { experList };